package com.game.constant;

public enum AchiType {

    AT_1(1, 1,"指挥官等级"),//完成
    AT_2(2, 1,"指挥官总战斗力"),//完成
    AT_3(3, 2,"累计消耗钻石"),//完成
    AT_4(4, 2,"累计获取x英雄"),//完成
    AT_5(5, 2,"x英雄突破至红色品质"),//完成
    AT_6(6, 2,"普通英雄招募x"),//完成
    AT_7(7, 2,"高级英雄招募x"),//完成
    AT_8(8, 2,"获取x本橙色兵书"),//完成
    AT_9(9, 1,"VIP等级达到x级"),//完成
    AT_10(10, 2,"打造x件橙色装备"),//完成
    AT_11(11, 2,"打造x件红色装备"),//完成
    AT_12(12, 1,"将x件橙色装备打造至满星"),//完成
    AT_13(13, 1,"将x件红色装备打造至满星"),//完成
    AT_14(14, 2,"完成x次英雄觉醒"),//完成
    AT_15(15, 2,"购买体力x次"),//完成
    AT_16(16, 2,"购买远征次数x次"),//完成
    AT_17(17, 2,"消耗12小时加速x个"),//todo
    AT_18(18, 2,"获得1次城市首杀"),//完成
    AT_19(19, 2,"在圣域成功攻打城池x次"),//完成
    AT_20(20, 2,"参与x次战火燎原"),//完成
    AT_21(21, 2,"参与x次圣域争霸"),//完成
    AT_22(22, 2,"成功攻打精英叛军x次"),//完成
    AT_23(23, 2,"阵营获取母巢之战胜利x次"),//完成
    AT_24(24, 1,"叛军入侵成功坚持x波进攻"),//完成
    AT_25(25, 2,"累计消耗兵力x"),//完成
    AT_26(26, 2,"累计训练兵力x"),//完成
    AT_27(27, 2,"累计掠夺资源x"),//完成
    AT_28(28, 2,"累计击飞其他玩家主城x次"),//完成
    AT_29(29, 2,"驻防友军主城x次"),//完成
    AT_30(30, 2,"累计消灭叛军x个"),//完成
    AT_31(31, 2,"累计消灭其他玩家兵力x"),//完成
    AT_32(32, 2,"成功占领敌方资源点x次"),//完成
    AT_33(33, 2,"成功侦察敌方主城x次"),//完成
    AT_34(34, 2,"据点征收x次"),//完成
    AT_35(35, 2,"通关远征x次"),//完成
    AT_36(36, 2,"解锁6个神器"),//完成
    AT_37(37, 2,"在地图上的采集点采集资源x"),//完成
    AT_38(38, 1,"主城升级至x级"),//完成
    AT_39(39, 1,"大学升级至x级"),//完成
    AT_40(40, 1,"城墙升级至x级"),//完成
    AT_41(41, 1,"步兵营升级到x级"),//todo
    AT_42(42, 2,"阵营建设x次"),//完成
    AT_43(43, 2,"完成阵营任务x次"),//完成
    AT_44(44, 1,"解锁科技：战功显赫"),
    AT_45(45, 1,"解锁科技：晋升制度"),
    AT_46(46, 1,"解锁科技：建筑规划"),
    AT_47(47, 2,"完成船坞订单x次"),
    AT_48(48, 2,"大学中雇佣学者x次"),//完成
    AT_49(49, 2,"城镇中心雇佣佃农x次"),
    AT_50(50, 2,"成功钓鱼x次"),//完成
    AT_51(51, 2,"累计获取x个不同类型鱼饵"),
    AT_52(52, 2,"拥有x条龙"),//完成
    AT_53(53, 2,"投喂x次龙"),//完成
    AT_54(54, 2,"累计在市场采购x次"),//完成
    AT_55(55, 2,"累计签到x天"),//完成
    AT_56(56, 2,"累计使用x个5分钟加速"),
    AT_57(57, 2,"累计使用x个1小时加速"),
    AT_58(58, 2,"累计使用x个战争保护"),//完成
    AT_59(59, 2,"累计使用x次普通迁城"),//完成
    AT_60(60, 2,"累计使用x次随机迁城"),//完成
    AT_61(61, 2,"累计使用x次大喇叭"),//完成
    AT_62(62, 2,"累计消耗体力x点"),//完成
    AT_63(63, 1,"累计拥有x位好友"),//完成
    ;
    int type;
    int set;//1.set 2.add
    String name;

    AchiType(int val, int set,String name) {
        this.type = val;
        this.set = set;
        this.name = name;
    }

    public int getType() {
        return type;
    }

    public void setType(int type) {
        this.type = type;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public int getSet() {
        return set;
    }

    public void setSet(int set) {
        this.set = set;
    }
}
