package com.game.constant;

/**
 * 2020年6月8日
 * 
 * @CaoBing halo_common BeautSkillType.java
 **/
public interface BeautySkillType {
	/**
	 * //精打细算------->>>>>>>>> 例如:增加金币征收量1% -> 2% ------->>>>>>>>>ok
	 */
	int SPEED_UP_COLLECT_IRON = 1;  
	
	
	
	
	/**
	 * //增加讨伐虫族获得的金币------->>>>>>>>> 例如:增加讨伐虫族获得的金币1% -> 2% ------->>>>>>>>>ok
	 */
	int SPEED_UP_MONSTER_IRON = 2;  
	
	
	
	
	/**
	 * // 加快民居的升级速度------->>>>>>>>> 例如:加快民居的升级速度1% -> 2% ------->>>>>>>>>ok
	 */
	int SPEED_UP_RESIDENT_LEV = 3; 
	
	
	
	
	/**
	 * // 增加英雄的守城属性------->>>>>>>>> 例如:增加英雄的守城属性302,3 ->20,6 增加指定英雄属性(302为英雄的type)
	 */
	int ADD_GUARD_HERO_302_PROPERTY = 4; 
	
	
	
	
	/**
	 * // 增加步兵英雄获得经验------->>>>>>>>> 例如:增加步兵英雄获得经验1% -> 2%
	 */
	int ADD_TYPE_OF_INFANTRY_HERO_EXP = 5; 
	
	
	
	
	/**
	 * // 增加英雄攻城属性------->>>>>>>>> 例如:增加英雄攻城属性20,3 ->20,6(20为英雄的type)
	 */
	int ADD_ATTACK_HERO_20_PROPERTY = 6;  
	
	
	
	
	/**
	 * 加快科技学院的升级速度 ------->>>>>>>>> 例如:加快科技学院的升级速度1% -> 2% ------->>>>>>>>>ok
	 */
	int SPEED_UP_TECH_LEV = 7; 
	
	
	
	
	/**
	 * // 增加讨伐虫族获得蓝图纸的概率------->>>>>>>>> 例如:增加讨伐虫族获得蓝图纸的概率1% -> 2%
	 */
	int ADD_BLUE_PAPER_PROBABILITY = 8; 
	
	
	
	
	/**
	 * // 增加讨伐虫族时的行军速度------->>>>>>>>> 例如:增加讨伐虫族时的行军速度1% -> 2%  ------->>>>>>>>>ok
	 */
	int SPEED_UP_MONSTER_MARCH = 9; 
	
	
	
	
	/**
	 * // 增加英雄的守城属性------->>>>>>>>> 例如:增加英雄的守城属性20,3 ->20,6 增加指定英雄属性(20为英雄的type)
	 */
	int ADD_GUARD_HERO_20_PROPERTY = 10; 
	
	
	
	
	/**
	 * // 最大可保护资源增加------->>>>>>>>> 例如:最大可保护资源增加1.5% -> 3%  ------->>>>>>>>>ok
	 */
	int ADD_MAX_RESOURCE_WAREHOUSE = 11; 
	
	
	
	
	/**
	 * // 加快仓库升级速度------->>>>>>>>> 例如:加快仓库升级速度1% -> 2%  ------->>>>>>>>>ok
	 */
	int SPEED_UP_WAREHOUSE_LEV = 12; 
	
	
	
	
	/**
	 * // 增加英雄的守城属性------->>>>>>>>> 例如:增加英雄的守城属性301,3 ->20,6 增加指定英雄属性(301为英雄的type)
	 */
	int ADD_GUARD_HERO_301_PROPERTY = 13; 
	
	
	
	/**
	 * // 增加采集时获得的食物------>>>>>>>>> 例如:增加采集时获得的食物1% -> 2%  ------->>>>>>>>>ok
	 */
	int SPEED_UP_COLLECT_OIL = 14; 
	
	
	
	
	/**
	 * // 增加虫兵英雄获得经验------->>>>>>>>> 例如:增加虫兵英雄获得经验1% -> 2%
	 */
	int ADD_TYPE_OF_MONSTER_HERO_EXP = 15; 
	
	
	
	
	
	/**
	 * //钢铁增产------->>>>>>>>> 例如:增加钢铁征收量1% -> 2% ------->>>>>>>>>
	 */
	int SPEED_UP_COLLECT_COPPER = 16;
	
	
	
	
	
	/**
	 * //钢铁缴获------->>>>>>>>> 例如:增加讨伐世界虫族获得的钢铁1% -> 2%------->>>>>>>>>
	 */
	int SPEED_UP_MONSTER_COPPER = 17;
	
	
	
	
	
	/**
	 * //铁矿建设------->>>>>>>>> 例如:加快铁矿厂的升级速度1% -> 2%------->>>>>>>>>
	 */
	int SPEED_UP_COPPER_LEV = 18;
	
	
	
	
	/**
	 * // 增加英雄的守城属性------->>>>>>>>> 例如:增加英雄的守城属性43,3 ->43,6 增加指定英雄属性(43为英雄的type)
	 */
	int ADD_GUARD_HERO_43_PROPERTY = 19; 
	
	
	
	
	
	/**
	 * // 坦克训练------->>>>>>>>> 例如:增加坦克兵英雄获得经验1% -> 2%
	 */
	int ADD_TYPE_OF_TANK_HERO_EXP = 20; 
}
